/* eslint-disable no-unused-vars */
export enum TargetType {
  Person = '人员',
  Company = '单位',
  Group = '集团',
  SubGroup = '子集团',
  Department = '部门',
  Job = '工作组',
  Cohort = '群组',
}

/** 绝句欣赏 */
export const Quatrains: string[] = [
  '两个黄鹂鸣翠柳，一行白鹭上青天。</br>窗含西岭千秋雪，门泊东吴万里船。',
  '乘兴南游不戒严，九重谁省谏书函。</br>春风举国裁宫锦，半作障泥半作帆。',
  '兰陵美酒郁金香，玉碗盛来琥珀光。</br>但使主人能醉客，不知何处是他乡。',
  '远上寒山石径斜，白云深处有人家。</br>停车坐爱枫林晚，霜叶红于二月花。',
  '京口瓜洲一水间，钟山只隔数重山。</br>春风又绿江南岸，明月何时照我还。',
  '碧玉妆成一树高，万条垂下绿丝绦。</br>不知细叶谁裁出，二月春风似剪刀。',
  '月落乌啼霜满天，江枫渔火对愁眠。</br>姑苏城外寒山寺，夜半钟声到客船。',
  '蓬头稚子学垂纶，侧坐莓苔草映身。</br>路人借问遥招手，怕得鱼惊不应人。',
  '独怜幽草涧边生，上有黄鹂深树鸣。</br>春潮带雨晚来急，野渡无人舟自横。',
  '剑外忽传收蓟北，初闻涕泪满衣裳。</br>却看妻子愁何在，漫卷诗书喜欲狂。',
  '白日放歌须纵酒，青春作伴好还乡。</br>即从巴峡穿巫峡，便下襄阳向洛阳。',
  '泉眼无声惜细流，树阴照水爱晴柔。</br>小荷才露尖尖角，早有蜻蜓立上头。',
  '寒雨连江夜入吴，平明送客楚山孤。</br>洛阳亲友如相问，一片冰心在玉壶。',
  '故人西辞黄鹤楼，烟花三月下扬州。</br>孤帆远影碧空尽，唯见长江天际流。',
  '清明时节雨纷纷，路上行人欲断魂。</br>借问酒家何处有，牧童遥指杏花村。',
  '两个黄鹂鸣翠柳，一行白鹭上青天。</br>窗含西岭千秋雪，门泊东吴万里船。',
  '日照香炉生紫烟，遥看瀑布挂前川。</br>飞流直下三千尺，疑是银河落九天。',
  '烟笼寒水月笼沙，夜泊秦淮近酒家。</br>商女不知亡国恨，隔江犹唱后庭花。',
  '横看成岭侧成峰，远近高低各不同。</br>不识庐山真面目，只缘身在此山中。',
  '飞来山上千寻塔，闻说鸡鸣见日升。</br>不畏浮云遮望眼，自缘身在最高层。',
  '应怜屐齿印苍苔，小扣柴扉久不开。</br>春色满园关不住，一枝红杏出墙来。',
  '李白乘舟将欲行，忽闻岸上踏歌声。</br>桃花潭水深千尺，不及汪伦送我情。',
  '杨花落尽子规啼，闻道龙标过五溪。</br>我寄愁心与明月，随风直到夜郎西。',
];
